tap "babashka/brew"
tap "borkdude/brew"
tap "homebrew/bundle"
tap "tow8ie/tow8ie"

brew "ack"
brew "asdf"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "clojure"
brew "direnv"
brew "editorconfig"
brew "fd"
brew "fish"
brew "fzf"
brew "jq"
brew "neovim"
brew "ranger"
# Fixes the problem that when using tmux on Mac OS X the system clipboard is
# not available by default.
# @see: https://github.com/ChrisJohnsen/tmux-MacOSX-pasteboard
# brew "reattach-to-user-namespace"
brew "starship"
brew "the_silver_searcher"
brew "thefuck"
brew "tmux"
# brew "trash"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "zplug"
brew "zsh"
brew "zsh-autosuggestions"

cask "contexts"
cask "marked"
cask "rectangle"
cask "the-unarchiver"

vscode "42Crunch.vscode-openapi"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "GitHub.github-vscode-theme"
vscode "golang.go"
vscode "golf1052.base16-generator"
vscode "mechatroner.rainbow-csv"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
