tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'tow8ie/tow8ie'
tap "homebrew/cask"

brew 'ack'
brew 'asdf'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
# Is used by Pallet (https://github.com/rdallasgray/pallet) for managing Emacs
# package dependencies.
# brew 'cask'
brew 'direnv'
brew 'editorconfig'
brew 'fd'
brew 'fish'
brew 'fzf'
brew 'jq'
brew 'neovim'
brew 'ranger'
# Fixes the problem that when using tmux on Mac OS X the system clipboard is
# not available by default.
# @see: https://github.com/ChrisJohnsen/tmux-MacOSX-pasteboard
# brew 'reattach-to-user-namespace'
brew 'starship'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'tmux'
# brew 'trash'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'wget'

brew 'zsh'
brew 'zplug'
brew 'zsh-autosuggestions'

cask "rectangle"
cask "the-unarchiver"
cask "contexts"
cask "caffeine"
cask "marked"
cask "alfred"

